---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCGeometryInfo.Dispose
source: html/6c435da1-0a13-3db8-1aac-98df23087759.htm
---
# Autodesk.Revit.DB.IFC.IFCGeometryInfo.Dispose Method

Releases all resources used by the IFCGeometryInfo

## Syntax (C#)
```csharp
public void Dispose()
```